
Процедура ПриЗаписи(Отказ, Замещение)
	
	Для Каждого Строка Из ЭтотОбъект Цикл
		МенеджерЗаписи = РегистрыСведений.ИсторияДанныеРДЛТелеком.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Строка);
		МенеджерЗаписи.Период = ТекущаяДата();
		Попытка
			МенеджерЗаписи.Записать();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось записать историю для РДЛ Телеком";
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры
