
&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
	
	АдресWSDL = "https://217.12.103.145/csp/awlsbp/AWGW.WS.cls?wsdl";
	URIПространстваИмен ="http://finstream.ru/csp/awl";
	ИмяСервиса = "PUPAY";
	ИмяТочкиПодключения = "";
	ИмяПользователя = "client";
	Пароль = "ph7s3LG8k.";

	Определение = Новый WSОпределения(АдресWSDL);
    Прокси = Новый WSПрокси(Определение,URIПространстваИмен,ИмяСервиса,ИмяТочкиПодключения);

//	Протокол = "";
//	Позиция = СтрНайти(АдресWSDL, "://");
//	Если Позиция > 0 Тогда
//		Протокол = НРег(Лев(АдресWSDL, Позиция - 1));
//	КонецЕсли;
//		
//	Если (Протокол = "https" Или Протокол = "ftps") Тогда
//		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(,);
//	КонецЕсли;
//	
//	WSОпределения = WSОпределения(АдресWSDL, ИмяПользователя, Пароль,, ЗащищенноеСоединение);
//	
//	Если ПустаяСтрока(ИмяТочкиПодключения) Тогда
//		ИмяТочкиПодключения = ИмяСервиса + "Soap";
//	КонецЕсли;
//	
//	ИнтернетПрокси = Неопределено;
//
//	
//	Прокси = Новый WSПрокси(WSОпределения, URIПространстваИмен, ИмяСервиса, ИмяТочкиПодключения,
//		ИнтернетПрокси, , ЗащищенноеСоединение, , );
//	
//	Прокси.Пользователь = ИмяПользователя;
//	Прокси.Пароль       = Пароль;
//	


КонецПроцедуры
