
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.СобытияПоКассам.Записывать = Истина;
	
	СобытиеСКассами = Движения.СобытияПоКассам.Добавить();
	СобытиеСКассами.Период = Дата;
	СобытиеСКассами.Касса = Касса;
	
	Если ВидЧека = Перечисления.ВидыЧеков.ОтчётРегистрации ИЛИ  ВидЧека = Перечисления.ВидыЧеков.ОтчетПеререгистрации Тогда
		СобытиеСКассами.Событие = Перечисления.СобытияСКассами.УстановкаФН;
	Иначе
		СобытиеСКассами.Событие = Перечисления.СобытияСКассами.СнятиеФН;	
	КонецЕсли;
	
	СобытиеСКассами.ФН = ФН;
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
			
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =   "ВЫБРАТЬ
	|	Чек.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Чек КАК Чек
	|ГДЕ
	|	Чек.ФП = &ФП
	|	И Чек.Проведен
	|	И НЕ Чек.Ссылка = &Ссылка" ;
	Запрос.УстановитьПараметр("ФП",ФП);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Отказ = Истина;
		Сообщить("Найден ФП");
	КонецЕсли;
	
КонецПроцедуры
