
&НаСервере
Процедура ПолучитьДанныеТелекомНаСервере()
	// Вставить содержимое обработчика.
	Объект.ДанныеРДЛТелеком.Очистить();
	//Сервер = "internet.rdl.club";
	//
	//Попытка
	//	HTTP =  Новый HTTPСоединение(Сервер,,,,,Истина);
	//Исключение
	//КонецПопытки ;
	//СтартоваяДата = Формат(Объект.НачалоПериода,"ДФ='yyyy-MM-dd ЧЧ:мм:сс'");
	//КодироватьСтроку(СтартоваяДата,СпособКодированияСтроки.КодировкаURL);
	//СтартоваяДата =СтрЗаменить(СтартоваяДата," ","%20");
	//КонечнаяДата =  Формат(Объект.КонецПериода,"ДФ='yyyy-MM-dd ЧЧ:мм:сс'");
	//КодироватьСтроку(КонечнаяДата,СпособКодированияСтроки.КодировкаURL);
	//КонечнаяДата = СтрЗаменить(КонечнаяДата," ","%20");
	//
	//Ресурс = "getStatistics?";
	//Если ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
	//	Ресурс = Ресурс + "startTime=" + СтартоваяДата;
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(Объект.КонецПериода) Тогда
	//	Ресурс = Ресурс +"&endTime=" + КонечнаяДата;
	//КонецЕсли;
	//
	//
	//
	//HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
	//
	//ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();	 
	//HTTPОтвет = HTTP.Получить(HTTPЗапрос,ИмяФайлаОтвета);
	//
	//ЧтениеJSON = Новый ЧтениеJSON;
	//ЧтениеJSON.ОткрытьФайл(ИмяФайлаОтвета);
	//Данные = ПрочитатьJSON(ЧтениеJSON);
	//ЧтениеJSON.Закрыть();
	//Для Каждого Строка Из Данные.Statistics Цикл 
	//	НоваяСтрокаДанных = Объект.ДанныеРДЛТелеком.Добавить(); 
	//	ЗаполнитьЗначенияСвойств(НоваяСтрокаДанных,Строка);
	//	//ПреобразуемДаты
	//	НоваяСтрокаДанных.PaymentTime = ПреобразоватьДатуJson(Строка.PaymentTime);
	//	НоваяСтрокаДанных.RefundTime = ПреобразоватьДатуJson(Строка.RefundTime);
	//КонецЦикла;
	
	ДанныеРдл = Обработки.ПолучитьДанныеРДЛ.ПолучитьДанныеРДЛТелекомЗаПериод(Объект.НачалоПериода,Объект.КонецПериода);
	
	Для Каждого Строка Из ДанныеРдл Цикл 
		НоваяСтрокаДанных = Объект.ДанныеРДЛТелеком.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДанных,Строка);
		//ПреобразуемДаты
		НоваяСтрокаДанных.PaymentTime = РДЛТелеком.ПреобразоватьДатуJson(Строка.PaymentTime);
		Попытка
			НоваяСтрокаДанных.RefundTime =  РДЛТелеком.ПреобразоватьДатуJson(Строка.RefundTime);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьДанныеТелеком(Команда)
	ПолучитьДанныеТелекомНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеНаСервере()
	// Вставить содержимое обработчика.
	Для Каждого Строка ИЗ Объект.ДанныеРДЛТелеком Цикл
		МенеджерЗаписи = РегистрыСведений.ДанныеРДЛТелеком.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,строка);
		Попытка
			МенеджерЗаписи.Записать();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	ЗаписатьДанныеНаСервере();
КонецПроцедуры
