
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Объект.ДанныеПосредников.Очистить();
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанныеПосредников(Команда)
	ЗаписатьДанныеПосредниковНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеПосредниковНаСервере()
	
	СтруктураДанных = Новый Структура();	
	СтруктураДанных.Вставить("Месяц",НачалоМесяца(Объект.ДатаНачала));
	СтруктураДанных.Вставить("Данные",Объект.ДанныеПосредников.Выгрузить());
	АдресВХранилище = ПоместитьВоВременноеХранилище(СтруктураДанных,УникальныйИдентификатор);
	
	Обработки.ДанныеПосредников.ЗаписатьДанныеПосредников(АдресВХранилище);
	
КонецПроцедуры


&НаСервере
Процедура ПериодПриИзмененииНаСервере()
	Объект.ДатаНачала = Период.ДатаНачала;
	Объект.ДатаОкончания = Период.ДатаОкончания;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеЗаПериод(Команда)
	
	Объект.ДанныеПосредников.Очистить();
	
	Если ПроверитьЗаполнение() Тогда
		ПолучитьДанныеЗаПериодНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеЗаПериодНаСервере()
	
	СтруктураДанных = Новый Структура();
	
	СтруктураДанных.Вставить("ДатаНачала",Объект.ДатаНачала);
	
	СтруктураДанных.Вставить("ДатаОкончания",Объект.ДатаОкончания);
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(СтруктураДанных,УникальныйИдентификатор);
	
    Обработки.ДанныеПосредников.ПолучитьДанныеПровайдеровЗаПериод(АдресВХранилище);
	
	СтруктураСДанными = ПолучитьИзВременногоХранилища(АдресВХранилище);
	
	ДанныеДляЗагрузки = Новый ТаблицаЗначений();
	
	СтруктураСДанными.Свойство("Данные",ДанныеДляЗагрузки);
	
	Объект.ДанныеПосредников.Загрузить(ДанныеДляЗагрузки);
	
	УдалитьИзВременногоХранилища(АдресВХранилище);
	
КонецПроцедуры
