
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодПриИзмененииНаСервере()
	Объект.ДатаНачала = Период.ДатаНачала;
	Объект.ДатаОкончания = Период.ДатаОкончания;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеЗаПериод(Команда)
	
	Объект.ДанныеПосредников.Очистить();
	
	Если ПроверитьЗаполнение() Тогда
		ПолучитьДанныеЗаПериодНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеЗаПериодНаСервере()
	
	СтруктураДанных = Новый Структура();
	
	СтруктураДанных.Вставить("ДатаНачала",Объект.ДатаНачала);
	
	СтруктураДанных.Вставить("ДатаОкончания",Объект.ДатаОкончания);
	
	АдресВХранидище = ПоместитьВоВременноеХранилище(СтруктураДанных,УникальныйИдентификатор);
	
    Обработки.ДанныеПосредников.ПолучитьДанныеПровайдеровЗаПериод(АдресВХранидище);
	
	СтруктураСДанными = ПолучитьИзВременногоХранилища(АдресВХранидище);
	
	ДанныеДляЗагрузки = Новый ТаблицаЗначений();
	
	СтруктураСДанными.Свойство("Данные",ДанныеДляЗагрузки);
	
	Объект.ДанныеПосредников.Загрузить(ДанныеДляЗагрузки);
	
КонецПроцедуры
